# ============== LOGO ==============

# Цвет логотипа (LOGO_COLOR)
# 0 - Белый
# 1 - Стандартный (градиент)
# 2 - Синий
# 3 - Голубой
# 4 - Зелёный
# 5 - Фиолетовый
# 6 - Жёлтый
LOGO_COLOR = 1

# Стиль логотипа (LOGO_STYLE)
# 1 - Стандартный
# 2 - Bloody
# 3 - Colossal
# 4 - DOS Rebel
LOGO_STYLE = 1

# ============== INFO ==============

# Цвет ключа при выводе информации логина (LOGIN_INFO_KEY_COLOR)
# Пример: Ключ: Значение, или "Логин (ключ): ExampleAccount#0001 (значение)"
# 0 - Белый
# 1 - Стандартный (зелёный)
# 2 - Синий
# 3 - Голубой
# 4 - Фиолетовый
# 5 - Жёлтый
LOGIN_INFO_KEY_COLOR = 1

# Цвет значения при выводе информации логина (LOGIN_INFO_VAL_COLOR)
# Пример: Ключ: Значение, или "Логин (ключ): ExampleAccount#0001 (значение)"
# 0 - Белый
# 1 - Стандартный (голубой)
# 2 - Синий
# 3 - Зелёный
# 4 - Фиолетовый
# 5 - Жёлтый
LOGIN_INFO_VAL_COLOR = 1

# ============== LINE ==============

# Цвет линии (разделителя логов и основной информации) (SEP_LINE_COLOR)
# 0 - Белый
# 1 - Стандартный (голубой)
# 2 - Синий
# 3 - Зелёный
# 4 - Фиолетовый
# 5 - Жёлтый
SEP_LINE_COLOR = 1

# ============== LOGS ==============

# Цвет времени и контента в логах (LOGS_TIME_AND_CONTENT_COLOR)
# 0 - Белый
# 1 - Стандартный (зелёный)
# 2 - Синий
# 3 - Голубой
# 4 - Фиолетовый
# 5 - Жёлтый
LOGS_TIME_AND_CONTENT_COLOR = 1

# Цвет типа в логах (LOGS_TYPE_COLOR)
# Пример: Ключ: Значение, или "Логин (ключ): ExampleAccount#0001 (значение)"
# 0 - Белый
# 1 - Стандартный (голубой)
# 2 - Синий
# 3 - Зелёный
# 4 - Фиолетовый
# 5 - Жёлтый
LOGS_TYPE_COLOR = 1

# ============== MORE ==============

# Всегда мини-версия логотипа (ALWAYS_MINI_INTRO)
# True    / ДА
# False   / НЕТ
ALWAYS_MINI_INTRO = False
